automation/vulnerability-test-results/artillery-load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - name: "Baseline Load Test"
      duration: 60
      arrivalRate: 5
      rampTo: 15
      # Approximately 100 concurrent requests at peak
    - name: "Endurance Test"
      duration: 1800
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Homepage API Interaction"
    flow:
      - get:
          url: "/api/homepage-hero/"
      - get:
          url: "/api/campus-gallery/"
